org/about-fonts-antialias.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t
#+LAYOUT: post
#+AUTHOR: yefeiyu
#+DATE: 2018-04-09 一 11:20
#+TITLE: About fonts antialias
#+DESCRIPTION: change the fonts to antialiasing
#+TAGS: pc, fonts, antialise
#+CATEGORIES: soft

Add this code to `/etc/fonts/fonts.conf`
<match target="font" >
  <edit mode="assign" name="antialias" >
   <bool>false</bool>
  </edit>
 </match>
#+BEGIN_SRC ruby
function eink_page (I) {
var styles=
    '* { background: white !important; color: black !important; font-family: Caecilia !important; font-size: 23pt !important; line-height: 45px !important; }'+
    ':link, :link * { color: #333333 !important; }'+
    ':visited, :visited * { color: #d75047 !important; }';
    var document = I.buffer.document;
    var newSS=document.createElement('link');
    newSS.rel='stylesheet';
    newSS.href='data:text/css,'+escape(styles);
    document.getElementsByTagName("head")[0].appendChild(newSS);
}
interactive("eink-page",
"Eink the page in an attempt to save your eyes.", eink_page);
define_key(content_buffer_normal_keymap, "p", "eink-page");

#+END_SRC
#+BEGIN_SRC lisp
function eink_page (I) {
var styles=
    '* { background: white !important; color: black !important; font-family: Caecilia !important; font-size: 23pt !important; line-height: 45px !important; }'+
    ':link, :link * { color: #333333 !important; }'+
    ':visited, :visited * { color: #d75047 !important; }';
    var document = I.buffer.document;
    var newSS=document.createElement('link');
    newSS.rel='stylesheet';
    newSS.href='data:text/css,'+escape(styles);
    document.getElementsByTagName("head")[0].appendChild(newSS);
}
interactive("eink-page",
"Eink the page in an attempt to save your eyes.", eink_page);
define_key(content_buffer_normal_keymap, "p", "eink-page");

#+END_SRC
#+BEGIN_SRC c
function eink_page (I) {
var styles=
    '* { background: white !important; color: black !important; font-family: Caecilia !important; font-size: 23pt !important; line-height: 45px !important; }'+
    ':link, :link * { color: #333333 !important; }'+
    ':visited, :visited * { color: #d75047 !important; }';
    var document = I.buffer.document;
    var newSS=document.createElement('link');
    newSS.rel='stylesheet';
    newSS.href='data:text/css,'+escape(styles);
    document.getElementsByTagName("head")[0].appendChild(newSS);
}
interactive("eink-page",
	"Eink the page in an attempt to save your eyes.", eink_page);
define_key(content_buffer_normal_keymap, "p", "eink-page");
#+END_SRC
;;s	#+beginsrc	…	#+endsrc
#+BEGIN_SRC java

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_SRC
#+BEGIN_SRC lisp

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_SRC
#+BEGIN_SRC ruby

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_SRC

;;e	#+beginexample	…	#+endexample
#+BEGIN_EXAMPLE

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_EXAMPLE
;;q	#+beginquote	…	#+endquote
#+BEGIN_QUOTE

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_QUOTE
;;v	#+beginverse	…	#+endverse
#+BEGIN_VERSE

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_VERSE
;;c	#+begincenter	…	#+endcenter
#+BEGIN_CENTER

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_CENTER
;;l	#+beginlatex	…	#+endlatex
#+BEGIN_LaTeX

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_LaTeX
;;L	#+latex:
#+LaTeX: 

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+LaTeX: 
;;h	#+beginhtml	…	#+endhtml
#+BEGIN_HTML

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_HTML
;;H	#+html:
#+HTML: 

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
;;a	#+beginascii	…	#+endascii
#+BEGIN_ASCII

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
#+END_ASCII
;;A	#+ascii:
#+ASCII: 

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
;;i	#+index:	line
#+INDEX: 

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
;;I	#+include:	line
<I

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
;;s	#+beginsrc	…	#+endsrc
#+BEGIN_SRC 
#+BEGIN_SRC 
COPY package.json /home/xx/gh/yefeiyu.github.io/COPY package.json /home/xx/gh/yefeiyu.github.io/
#+END_SRC

#+END_SRC
;;e	#+beginexample	…	#+endexample
;;q	#+beginquote	…	#+endquote
;;v	#+beginverse	…	#+endverse
;;c	#+begincenter	…	#+endcenter
;;l	#+beginlatex	…	#+endlatex
;;L	#+latex:
;;h	#+beginhtml	…	#+endhtml
;;H	#+html:
;;a	#+beginascii	…	#+endascii
;;A	#+ascii:
;;i	#+index:	line
;;I	#+include:	line

FROM starefossen/ruby-node

RUN apt-get update && \
    apt-get -y install apt-utils sudo && \
    useradd -d /home/xx -m -s /bin/bash xx && \
    echo xx:xx | chpasswd && \
    adduser xx sudo && \
    npm install -g bower grunt-cli
USER xx
RUN mkdir /home/xx/.ssh/ && \
    mkdir /home/xx/mt/ && \
    mkdir -p /home/xx/gh/yefeiyu.github.io/
COPY .bash_aliases /home/xx/
COPY Gemfile /home/xx/gh/yefeiyu.github.io/
COPY package.json /home/xx/gh/yefeiyu.github.io/
WORKDIR /home/xx/gh/yefeiyu.github.io/
RUN bundle install && \
    rm *
